[
  {
    "name": "Marcus D. King",
    "title": "Founder and Senior Pastor, Disciple Central Community Church",
    "text": "Shaniqua Rischer/Rischer Consulting has helped push our church to greater levels even in a pandemic. For several years, Rischer Consulting has helped us feed thousands in our community, offer employment opportunities, educate with financial literacy through workshops, received nearly $100,000 through well-structured written grants, job fairs managed with over 1,500 job seekers, and many partnerships formed. Rischer is the way to go if you desire to grow.",
    "image": "marcus.png"
  },
  {
    "name": "Destiny Brooks",
    "title": "Development Support Specialist, Mercy Street",
    "text": "Shaniqua Rischer/Rischer Consulting has proven to be an invaluable asset to our organization. Her seasoned expertise in grant writing and her experience as a grant reviewer gives her a unique edge and valuable perspective that will benefit any nonprofit organization. Shaniqua is professional, competent, well-organized, and a joy to work with. She has been successful in securing new funding for our organization and has been a great writing partner, asking important questions and believing in our mission just as much as we do. Her commitment to research and quality work is unparalleled, and I highly recommend her for all of your grant writing, researching, prospecting, and consulting needs.",
    "image": "destiny.png"
  },
  {
    "name": "Briana Rahnani",
    "title": "Cristo Rey, Dallas, TX",
    "text": "Shaniqua Rischer is a seasoned grant-writing and nonprofit professional. I began working with Shaniqua in 2016 when she served as a grant writer for a new school where she secured significant program and general operating funding. I currently work with her in a grant prospecting capacity. Shaniqua is dedicated to providing quality, timely service and deliverables to her clients and ensures that the grant research being conducted closely aligns with her client’s mission. I highly recommend Shaniqua Rischer and Rischer Consulting for your grant writing and nonprofit consulting needs!",
    "image": "briana.png"
  },
  {
    "name": "Julie Este-McDonald",
    "title": "Salt and Light Collaborative, Inc.",
    "text": "Shaniqua has a commitment and professionalism that is unparalleled. We are a new nonprofit, and her knowledge and expertise has been invaluable in helping us to develop as an organization in order to be awarded partnerships and grants. She is not only committed to her clients; she cares about the mission and will go above and beyond to help you succeed. I would highly recommend her and do recommend her to colleagues often.",
    "image": "julie.png"
  },
  {
    "name": "Ashlei Spivey",
    "title": "Founder & Director, I Be Black Girl",
    "text": "Shaniqua pushed us to think about the infrastructure needed to support grant writing. This includes having a consistent program budget, how we think about metrics and deliverables, as well as consistency in writing and language. She is a great grant writing partner.",
    "image": "ashlei.png"
  },
  {
    "name": "Christina Henderson",
    "title": "Small Business Owner, We Rock The Spectrum Kids Gym",
    "text": "I just want to say thank you, thank you, thank you, once again for serving and using your gifts. I remember taking your 'Small Business Start-Up' business course in 2017. I want you to know that your work did not fall on deaf ears. Although I did not step out on faith until last year, your course documents are still relevant today. I want you to know that I am the franchise owner of We Rock The Spectrum Kids Gym - Southwest Dallas. I am forever grateful for you guiding me along the way and sharing resources with me. I can’t thank you enough. Please continue to allow God to use you. Thank you again.",
    "image": "christina.png"
  }
]
