[
  {
    "name": "Shaniqua Rischer",
    "role": "PRINCIPAL CONSULTANT & COACH",
    "bio": "Shaniqua Rischer, M.ChEd. has an extensive background as a grant writer and development professional in the education and workforce development sector. She has served with the Department of Education and Department of Labor Grant Reviewer.\nShe is familiar with writing award-winning proposals, including writing, management / implementation, data tracking, and analysis. She is the owner and principal consultant of Rischer Consulting, a full-service consulting firm specializing in education, workforce development, and nonprofit consulting.\nWith 20 years of experience in the public and private sector, Rischer Consulting's foundation is integrity and execution. They work closely with nonprofit organizations and executive management teams to build capacity through a customized and personalized approach. She has raised over $10 million dollars since 2014 for clients and continues to work with organizations to help raise funds for day-to-day and programming operations.\nShaniqua also works with various faith-based institutions to create new start-up initiatives to further promote their core mission by assisting individuals and communities on a larger scale. She is a sought-after speaker and has published three books, &apos;Living A Fake Life For A Real God,&apos; &apos;God-Morning! Sixty Mornings With God,&apos; and &apos;The Boy Who Would Be King: 7 Lessons From the Life of David&apos;.\nAdditionally, she has founded At The Cross Global Ministries, a para ministry that focuses on local and global outreach. Shaniqua holds a Bachelor of Arts Degree in Government from The University of Texas at Austin and a Master of Arts Degree in Christian Education from Dallas Baptist University.",
    "image": "/images/shaniqua.png"
  },
  {
    "name": "Priscilla Okwuchukwu",
    "role": "EXECUTIVE ASSISTANT & PROJECT MANAGER",
    "bio": "Priscilla Okwuchukwu is a skilled virtual assistant with a strong focus on organization and efficiency. She is dedicated to providing exceptional support to streamline operations and enhance productivity with expertise in administrative support, project management, and customer service. She is vital in ensuring smooth operations and effective communication for Rischer Consulting. As Executive Assistant and Project Manager, Priscilla is committed to delivering high-quality service, helping the team thrive and clients achieve their goals with precision and care.",
    "image": "/images/priscilla.png"
  },
  {
    "name": "Christina Estes",
    "role": "CONSULTANT",
    "bio": "Christina Estes, M.Ed., has worked in the education sector for over 20 years. She has worked as a teacher crafting engaging lessons, instructional coach developing curriculum and new teachers, and a professional development specialist leading a team that created online and in-person professional development. Christina has assisted school districts across the country in meeting their English learners' compliance and instructional needs. She has facilitated statewide sessions at the Texas Association for the Gifted and Talented conference and nationally at LEAD Forward. She holds a Bachelor of Arts degree in English from The University of Texas at Austin and a Masters in Educational Administration from Texas A&M Central Texas.",
    "image": "/images/christinae.png"
  },
  {
    "name": "Cheryl Richer",
    "role": "EXECUTIVE COACH",
    "bio": "Cheryl Rischer, M.Ed., is a trained and certified Cognitive Coach with over 25 years of experience. Cheryl is recognized across many industries as an accomplished people leader, executive coach, and leadership consultant with a solid reputation for enhancing organizational and leadership development. As a proven agent of change, she has vast experience across multiple industries delivering strategic impact. This has allowed her to facilitate growth while building the capacity of individuals by broadening and deepening their understanding of what while building capacity for the how and gaining clarity and improved focus on the why. Ultimately, this leads to better employees, greater productivity, improved products, and service delivery. Cheryl has supported over 100 clients, including non-profits, in the last 15+ years in setting goals, adapting to change, and meeting leadership demands. She holds a Bachelor of Science degree in Communications and Sociology from Baylor University and a Masters in Educational Administration with an emphasis in organizational leadership from the University of Texas in Austin. She also is a Certified Life Coach.",
    "image": "/images/cheryl.png"
  },
  {
    "name": "Briana Rahmani",
    "role": "DEVELOPMENT SPECIALIST",
    "bio": "Briana has a passion for helping others achieve their goals. She's worked in both the nonprofit and education fields throughout her 10+ year career.  has had the opportunity to develop knowledge and skills in development and grant writing, college counseling, teaching, and project management. Briana has earned a Bachelor of Business Administration in Management Information Systems from Texas A&M University, a Master of Science in Human Relations and Business from Amberton University, and a Specialized Certificate in College Counseling from the University of California San Diego Extension.",
    "image": "/images/briana.png"
  },
  {
    "name": "Brandie Steadham",
    "role": "MARKETING SPECIALIST",
    "bio": "As a highly regarded event specialist, Brandie Steadham has 20+ years in the event marketing and event management sector. As a practicing Event Manager, Brandie is responsible for the coordination, management and budgeting of various large association events, summits, and meetings.\nOver the past 20+ years she has managed and supported notable events, such as Mega Fest (Bishop T.D. Jakes premier faith-based entertainment festival) and the Pantene Total You Tour. She has also assisted for numerous years, with major sporting events, like the NBA Jam Session, and the State Farm Bayou Classic. She has provided client service and event expertise for major corporations such as Procter & Gamble, Coca-Cola, Nationwide, and Starbucks, just to name a few.\nAs an event management and marketing consulting for Shaniqua Rischer and her faith-based brand, Brandie manages the daily social media management and engagement. Along with that, she consults and supports many aspects of Ms. Rischer's overall brand management. Brandie's professional and community involvement include being a member of Alpha Kappa Alpha Sorority, Inc., and Meetings Professional International where she is the opportunity to learn and share the latest most innovative ideas for event planning.\nA graduate of the University of Texas at Austin, Brandie obtained her Bachelor of Arts in Sociology. Brandie is a native of Dallas (Garland), Texas.",
    "image": "/images/brandie.png"
  },
  {
    "name": "Faith Johnson",
    "role": "GRANT WRITER",
    "bio": "Faith Johnson brings over two years of dedicated experience in the non-profit sector as both a grant specialist and a funding and partnership officer. Her expertise extends across collaborations with Community-Based Organizations (CBOs) and national and international entities in diverse locations, including the US, Sudan, South Sudan, Nigeria, and Kenya. \nThroughout her career, she has consistently served as a contractor, excelling as a Grant Specialist and funding and partnership officer. She takes pride in successfully securing multiple grants, showcasing her ability to navigate the intricacies of grant acquisition. Beyond professional pursuits, she enjoys reading and is always eager to explore new opportunities that align with her passion for fostering positive change in the non-profit realm.",
    "image": "/images/faith.png"
  },
  {
    "name": "Gbemisola Takuro",
    "role": "GRANT WRITER",
    "bio": "Gbemisola Takuro is a development practitioner with over five years of experience working in program management, business development, and grant writing across various sectors in Africa and North America. Her passion lies in empowering communities through technology and strategic grant proposals that address critical needs and drive positive change. With a proven track record of securing thousands in funding, Gbemisola leverages her storytelling abilities to write compelling grant proposals that eloquently convey the organization’s narrative and impact. She is a meticulous researcher, and skilled communicator who takes pride in delivering successful outcomes to her clients. She is committed to accelerating impact.",
    "image": "/images/Gbemisola.png"
  },
  {
    "name": "Regina Adolfo",
    "role": "SOCIAL MEDIA MANAGER",
    "bio": "Regina Adolfo is a journalism student at the University of the Philippines, Diliman. An aspiring multimedia journalist trained in marketing and social media engagement, Regina has a knack for writing stories ― both journalistic and creative.Her interest in the multimedia landscape has taken her to experience working in various fields, including news and feature writing, digital marketing, hosting, event planning, social engagement, and content creation. \nHaving been a consistent honor student since elementary, she has always valued and advocated for the importance of quality education among the youth. Apart from this, her advocacies include women and youth empowerment, press freedom, and environmental sustainability.\nAs a next-generation correspondent, Regina tries to highlight these relevant matters one post at a time. She’s a working student on some days and a storyteller on most.",
    "image": "/images/regina.png"
  }
]
